import random

compliments = {
    "male": {
        "age": [
            "В {age} лет выглядеть так классно — подвиг!",
            "В {age} лет уже можно гордиться своими достижениями!"
        ],
        "general": [
            "{name}, твоя энергия делает день ярче.",
            "{name}, твоя харизма невозможно не заметить."
        ]
    },
    "female": {
        "age": [
            "В {age} лет сиять так — талант!",
            "В {age} лет быть такой очаровательной — искусство!"
        ],
        "general": [
            "{name}, твоя улыбка озаряет всё вокруг.",
            "{name}, твоя харизма — как магнит!"
        ]
    }
}

name_list = {
    "male": {
        "денис": ["ден", "денюша", "день", "деня", "денчик", "денуся", "дениска", "деша"]
    },
    "female": {
        "маша": ["машуля", "машенька", "манюня"]
    }
}

def compliment(gender, age, name, lang):
    if lang == 1:
        gender = gender.lower()
        name = name.lower()
    elif lang == 2:
        pass